Repository: 84000/data-translation-memory
Catalog: toh671-v3.tmx
Source language: bo
Languages: en

source: དཔལ་ལྷ་མོ་ནག་མོའི་བསྟོད་པ་རྒྱལ་པོའི་རྒྱུད།
en: The Sovereign Tantra “Praises to Śrīdevī Kālī”

source: རིག་སྔགས་དང་གསང་སྔགས་ཀྱི་མངའ་བདག་དཔལ་ཕྱག་ན་རྡོ་རྗེ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to glorious Vajrapāṇi, lord of vidyās and mantras.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: རི་རབ་ཀྱི་རྩེ་མོ་རྩུབ་འགྱུར་གྱི་ཚལ་ཆེན་པོ་ན་བཅོམ་ལྡན་འདས་དཔལ་དྲག་པོ་ཆེན་པོ་ཕྱག་ན་རྡོ་རྗེ་ལུས་བསྐལ་པའི་མེ་ལྟར་འབར་བ། སྲིད་པ་གསུམ་ལས་རྣམ་པར་རྒྱལ་བ། ཉི་མ་སྟོང་གི་གཟི་བརྗིད་དང་ལྡན་ནས་བཞུགས་སོ། །འཁོར་ནི་བརྒྱ་བྱིན་དང་། ཤ་ཟ་དང་།
en: In the vast Pāruṣyaka grove on the summit of Mount Sumeru, the blessed and glorious great fierce one Vajrapāṇi—whose body blazes like the fire that consumes the world at the end of an eon, who is victorious over the threefold world, and who burns with the fire of a thousand suns—sat surrounded by a retinue including Śakra and a horde of piśācas, rākṣasas, and mātṛkās numbering in the billions.

source: སྲིན་པོ་དང་། མ་མོའི་ཚོགས་བྱེ་བ་དུང་ཕྱུར་གྱིས་བསྐོར་ཏེ་བཞུགས་སོ། །དེའི་ཚེ་ན་དཔལ་ཕྱག་ན་རྡོ་རྗེ་པདྨའི་གདན་ལ་བཞུགས་ཏེ་བཀའ་སྩལ་པ། ངའི་འཁོར་དུ་གཏོགས་པའི་ལྷ་མ་སྲིན་སྡེ་བརྒྱད་ཉོན་ཅིག །
en: Seated on a lotus, glorious Vajrapāṇi proclaimed, “Eight classes of divine and demonic beings in my retinue, listen to me!

source: འདོད་པའི་ཁམས་འདི་ན་བདུད་ཀྱི་མ་གཤིན་རྗེའི་སྲིང་མོ་ཞེས་བྱ་བ་རྒྱལ་ཚབ་ཆེན་པོ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བསྟན་པ་འཛིན་པ་ཅིག་ཡོད་ཀྱིས།
en: There is a great regent in this desire realm known as the mother of the demon and Yama’s sister.

source: ཁྱེད་ཀྱིས་དེ་ལ་མཆོད་པ་གྱིས་ཤིག །
en: She upholds the teachings of all the buddhas, so you should make offerings to her and praise her.

source: བསྟོད་པ་གྱིས་ཤིག །ངས་ཀྱང་ཁྱོད་ལ་བྱིན་གྱིས་བརླབ་པོ་ཞེས་བཀའ་སྩལ་པ་དང་།
en: I give you my blessing!”

source: འཁོར་གྱི་ནང་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་སྟན་ལས་ལངས་ཏེ་དཔལ་ལྷ་མོ་ནག་མོ་ལ་དགེ་བ་བཅུའི་སྒོ་ནས་བསྟོད་པ། སྔོན་འདས་བསྐལ་པ་དང་པོའི་ཕ་རོལ་ན། །དགེ་བཅུའི་ལས་ལ་སེམས་རབ་ཆེར་སྦྱངས་ནས། །
en: Śakra, the lord of the gods, rose from his seat in the assembly and spoke the following verses praising Śrīdevī Kālī in terms of the ten virtuous actions: “Long ago, before the first eon, you trained your mind extensively in the ten virtuous actions.

source: ལམ་གྱི་ཁྱད་པར་གོང་མ་རབ་རྫོགས་ཀྱང་། །མཐོ་རིས་སྐྱེས་པ་རྣམས་ལ་དགེ་བ་བཅུའི། །ཚུལ་གྱིས་དོན་མཛད་ཕྱི་རོལ་བསྒྱུར་བ་ཡི། །དཔལ་ལྡན་ལྷ་མོ་ཁྱོད་ལ་ཕྱག་འཚལ་བསྟོད། །
en: Since then, though you have perfected the most exalted of paths, You benefit beings in the higher realms through ten virtuous actions— Homage and praise to you, Śrīdevī who converts outsiders.

source: འདས་པའི་དུས་ན་སྲོག་གཅོད་རབ་སྤངས་པས། །སྐུ་ཚེ་རིང་ཞིང་གཟུགས་བྱད་ཕུན་སུམ་ཚོགས། །གཞན་གྱི་ལན་ཆགས་གནོད་པའི་རྐྱེན་དང་ལྡན། །
en: “You gave up killing beings long ago, Attained a long life and wondrous form, And are free from karmic debt to others, the cause of harm.

source: འཆི་བདག་འཇོམས་མཛད་ཁྱོད་ལ་ཕྱག་འཚལ་བསྟོད། །
en: Homage to you who has conquered the Lord of Death.

source: མ་བྱིན་ལེན་སྤངས་ཚུལ་ལ་རབ་སྤངས་པས། །བསོད་ནམས་ཚོགས་ཀྱིས་ལོངས་སྤྱོད་ཕུན་སུམ་ཚོགས། །གཏེར་གྱི་ལོངས་སྤྱོད་མི་འགྲིབ་རབ་བརྟན་བརྙེས། །
en: “Because you gave up taking what is not given, The accumulation of merit has brought you abundant prosperity, And you discovered an undiminishing, stable wealth of treasure.

source: སྦྱིན་པའི་གཏེར་འཆང་ཁྱོད་ལ་ཕྱག་འཚལ་བསྟོད། །
en: Homage and praise to you who bears the treasure of generosity.

source: མི་ཚངས་སྤྱོད་པའི་བཀའ་རྣམས་བསྲུང་བ་དང་། །མངལ་གྱི་གྲོང་ཁྱེར་དམན་ལས་རྣམ་པར་འཕགས། །སྲིད་པའི་འདོད་ཆགས་རིང་དུ་སྤངས་པ་སྟེ། །
en: “You guard the teachings that warn against a lack of chastity, Have risen above the lowly city of the womb, And abandoned desire for existence long ago.

source: དགེ་སྦྱོང་ཆེན་མོ་ཁྱོད་ལ་ཕྱག་འཚལ་བསྟོད། །
en: Homage and praise to you, great female renunciant.

source: ཉོན་མོངས་བརྫུན་ཚིག་སྤངས་པའི་རྣམ་སྨིན་གྱིས། །གསུང་གི་དངོས་གྲུབ་འཇིག་རྟེན་འདུལ་བའི་གཙོ། །གསུང་མཆོག་རྣམ་དག་བརྙེས་པའི་རང་བཞིན་ཏེ།།
en: “As the result of abandoning the affliction of false words, You are a leader who tames the world with the accomplishment of speech, And have the nature of one who has attained pure, supreme speech.

source: བདེན་པར་གསུང་བ་ཁྱོད་ལ་ཕྱག་འཚལ་བསྟོད། །
en: Homage and praise to you who speak the truth.

source: ཕྲ་མའི་སྐྱོན་སྤངས་མི་ཕྱེད་འཁོར་དང་ལྡན། །
en: “You abandoned the fault of divisive speech and have an undivided retinue.

source: ཉིད་ལ་རྣམ་པར་དུལ་བའི་འཁོར་གྱིས་བསྐོར། །ལྷ་དང་ལྷ་མིན་བདེན་པས་འདུལ་མཛད་མ། །
en: A disciplined retinue surrounds you And you tame gods and asuras with the truth.

source: དཀར་མོའི་འཁོར་ཚོགས་ཁྱོད་ལ་ཕྱག་འཚལ་བསྟོད། །
en: Homage to you who have gathered a pure retinue.

source: ངག་འཁྱལ་སྤངས་པའི་ཡོན་ཏན་སྦྱིན་པ་ཡིས། །ཏིང་འཛིན་རྩེ་གཅིག་མི་གཡོ་བར་ཆད་སྤངས། །
en: “Gifted with the virtue of abandoning meaningless speech, You gave up disruptions to undistracted, single-pointed samādhi.

source: དགོས་འབྲེལ་ཚུལ་གྱིས་བསྟན་པ་སྐྱོང་མཛད་མ། །
en: You protect the teachings with your meaningful speech.

source: བྱིས་པ་འདུལ་མཛད་ཁྱོད་ལ་ཕྱག་འཚལ་བསྟོད། །
en: Homage and praise to you, tamer of childish beings.

source: ང་རྒྱལ་ཁེངས་སེམས་སྤངས་པའི་ཡོན་ཏན་གྱིས། །ཞི་བའི་ཚིག་འཇམ་ལྷ་མོ་དབྱངས་སྙན་མ། །ཚིག་རྩུབ་གཤེ་བའི་གཉེན་པོ་བྱེད་པ་སྟེ། །
en: “By virtue of abandoning pride and conceit, Goddess, In a melodious voice, you speak gentle, peaceful words, That are an antidote to abusive, harsh speech.

source: ངག་རྩུབ་འདུལ་མཛད་ཁྱོད་ལ་ཕྱག་འཚལ་བསྟོད། །
en: Homage and praise to you, tamer of harsh speech.

source: རང་སེམས་བརྣབ་སེམས་སྤངས་པའི་ཁྱད་པར་ནི། །འཛིན་པའི་རྣམ་རྟོག་རྣམ་པར་སྤངས་པའི་རྟགས། །བདག་མེད་རྟགས་སུ་སེང་གེས་རྣ་བ་བརྒྱན། །
en: “As a sign that you abandoned concepts of an apprehending subject And specifically abandoned covetousness in your own mind, The lion that symbolizes no-self adorns your ear.

source: བརྣབ་སེམས་སྤངས་པ་ཁྱོད་ལ་ཕྱག་འཚལ་བསྟོད། །
en: Homage and praise to you who have abandoned covetousness.

source: གཟུང་བའི་ཡུལ་ལ་གནོད་སེམས་རྣམ་པར་སྤངས། །ཕྱི་རོལ་ཡུལ་འདི་གཉིས་མེད་ཆོས་སུ་གཟིགས། །
en: “You abandoned harmful intent toward apprehended objects And view external objects as nondual phenomena.

source: གང་ལ་གནོད་སེམས་ཡང་དག་སྤངས་པའི་རྟགས། །སྦྲུལ་གྱི་རྣ་རྒྱན་ཅན་ལ་ཕྱག་འཚལ་བསྟོད། །
en: Homage and praise to you whose snake earring Is a sign of having fully abandoned such harmful intent.

source: ལོག་པར་ལྟ་བའི་ཆོས་ཕྱོགས་རྣམ་སྤངས་ཏེ། །སངས་རྒྱས་ཆོས་ལས་འཁྲུངས་པའི་གཟུགས་བརྙན་ཁྱོད། །ལྟ་བ་རྣམ་པར་དག་པའི་ངང་ཚུལ་ཅན། །
en: “You abandoned religious doctrines based on the wrong view And took a form aligned with the Buddha’s doctrine— One that embodies the pure view.

source: སྤྲོས་བྲལ་དོན་དམ་སྟོན་ལ་ཕྱག་འཚལ་བསྟོད། །
en: Homage and praise to you who display the ultimate, free of conceptuality.

source: འཇིག་རྟེན་འདི་ན་ལས་གཉིས་དག་མ་དག །
en: “There are two types of action in this world: pure and impure.

source: མ་དག་མི་དགེ་བཅུ་ལས་ངན་སོང་གྲུབ། །
en: The ten impure, nonvirtuous actions lead to the lower realms.

source: དག་པའི་དགེ་བ་བཅུ་ལས་མཐོ་རིས་གྲུབ། །
en: The pure, virtuous actions lead to higher birth.

source: ལས་འདི་དགེ་བ་དང་པོར་རབ་སྦྱངས་པས། །གོང་ནས་གོང་མའི་ས་ལ་རབ་གནས་ཀྱང་། །
en: Because you first trained in the virtuous actions, “You reside on progressively higher grounds.

source: དགེ་བཅུའི་རྟགས་ནི་དམན་པའི་ཞིང་འདིར་བསྟན། །གདུག་པའི་ཚུལ་ཅན་འགྲོ་བ་འདྲེན་མཛན་མ། །
en: You teach the signs of the ten virtuous actions in this inferior realm, Adopting a malevolent guise to guide beings.

source: བསྟོད་པར་འོས་པ་ཁྱོད་ལ་ཕྱག་འཚལ་བསྟོད། །དེ་ནས་དཔལ་ལྷ་མོ་ནག་མོ་ཆེན་མོ་ལ།
en: Homage and praise to you who are worthy of praise.”

source: གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་རྣམ་ཐོས་སྲས་ཀྱིས་ལམ་རྣམ་པ་ལྔའི་ཚུལ་གྱིས་བསྟོད་པ། དམ་པ་རྣམས་ཀྱིས་བགྲོད་པའི་ཁྱད་པར་ནི། །ཚོགས་ཀྱིས་སྦྱངས་ནས་དོན་དམ་མཐོང་བ་ཡི། །གཉེན་པོ་ཡེ་ཤེས་རིམ་པར་སྒོམ་པ་ལ། །མཐར་ཕྱིན་པ་ལ་གཤེགས་པའི་དོན་མཆོག་ལགས། །
en: Next, the yakṣa king Vaiśravaṇa praised Śrīdevī Mahākālī according to the system of the fivefold path: “After purifying the accumulations On the unique path traveled by the holy ones And gradually cultivating the antidote, wisdom that sees the ultimate, Your supreme goal is to reach perfection.

source: དེ་བས་ལྷ་མོ་ཁྱོད་ཀྱི་མཚན་ཉིད་ནི། །འདི་ལྟར་རབ་ལྡན་ཁྱོད་ཀྱི་ཁྱད་པར་ཏེ། །དང་པོའི་ཚོགས་ལས་ཡང་དག་རབ་བསགས་པས། །དང་པོའི་ས་ལས་སྦྱོར་བའི་ཏིང་འཛིན་བརྙེས། །
en: “That is why, Goddess, such attributes, That you specifically possess, Show that you perfectly gathered the accumulations from the first And attained the samādhi related to the application from the first stage.

source: རབ་ཏུ་དགའ་བའི་ས་ལ་དོན་དམ་ནི། །རྣམ་པར་མི་རྟོག་སྐྱེ་མེད་ཚུལ་གྱིས་གཟིགས། །
en: “You saw the ultimate on the ground of Utter Joy As nonconceptual and unarisen.

source: དཔལ་ལྡན་བྱང་ཆུབ་སེམས་དཔའི་ཁྱད་པར་ནི། །རང་སེམས་ས་གཉིས་དག་ལ་རབ་བརྟེན་ནས། །དེ་བཞིན་ས་གསུམ་དག་པའི་ཕ་རོལ་སོན། །
en: Then, with the unique qualities of a glorious bodhisattva, Relying on your own mind and the pure second ground, “You likewise reached the end of the pure third ground.

source: རང་སེམས་བཞི་བའི་ས་ལ་ཆེར་བསྒོམས་པས། །ལྔ་པའི་ས་ལ་བསམ་གཏན་ཕ་རོལ་སོན། །
en: You further cultivated your mind on the fourth ground And perfected concentration on the fifth ground.

source: རང་སེམས་དྲུག་པའི་ས་ལ་ཆེར་སྦྱངས་པས། །བདུན་པ་ལ་ནི་ཐབས་ཀྱི་ཕ་རོལ་སོན། །
en: You further purified your mind on the sixth ground “And perfected method on the seventh ground.

source: རང་སེམས་བརྒྱད་པ་ཉིད་ལ་ཆེར་བསྒོམས་པས། །དཔལ་ལྡན་ལྷ་མོ་ནག་མོ་སྨོན་ལམ་ཉིད། །དགུ་པ་ལ་ཡང་སྟོབས་ཀྱི་ཡོན་ཏན་སྒྲུབ། །
en: You further cultivated your mind on the eighth And, as Śrīdevī Kālī, made aspirations And attained the quality of power on the ninth.

source: དེ་ཡི་སྟོབས་ཀྱིས་ཡེ་ཤེས་འཕེན་པར་འགྲུབ། །
en: “That power will propel you on to wisdom.

source: འདི་དག་རྣམ་པར་རྫོགས་པར་བྱས་ནས་ནི། །སངས་རྒྱས་ས་ལ་སྨིན་པའི་སྨོན་ལམ་ཅན། །
en: After you perfected these grounds, You aspired to reach fruition on the ground of a buddha.

source: ས་བརྒྱད་ནོན་པས་གཞོན་ནུའི་ཚུལ་འཆང་མ། །འགྲོ་བ་འདུལ་ཕྱིར་དྲག་མོའི་ཚུལ་སྟོན་ཅིང་། །
en: You have a youthful form because you traversed the eighth ground “And appear in a fierce form to tame beings.

source: གདུག་པ་འདུལ་མཛད་ཁྱོད་ལ་ཕྱག་འཚལ་བསྟོད། །
en: Homage and praise to you, tamer of wicked beings!

source: བདག་ཀྱང་ཁྱོད་ཀྱི་ལམ་ལྟར་མྱུར་འགྲུབ་ཤོག །
en: May I complete the path as quickly as you!”

source: དེ་ནས་མིའམ་ཅིའི་རྒྱལ་པོ་ལྗོན་པ་རྟ་མགོ་ཅན་གྱིས་དཔལ་ལྷ་མོ་ནག་མོ་ཆེན་མོ་ལ་གཉིས་སུ་མེད་པའི་སྒོ་ནས་བསྟོད་པ། དཔལ་ལྡན་ལྷ་མོ་གཉིས་སུ་མེད་པ་སྟེ། །དོན་དམ་སྤྲོས་བྲལ་ཆོས་ཉིད་འདི་ལས་བཙལ། །
en: Next, the horse-headed kinnara king Druma praised Śrīdevī Mahākālī in terms of nonduality: “Śrīdevī, you are nondual; You are found within this ultimate, nonconceptual basic reality.

source: དོན་དམ་ཀུན་རྫོབ་གཉིས་སུ་མེད་པས་བདེན། །
en: You are true because the ultimate and relative are not two.

source: འཁོར་བ་མྱང་འདས་གཉིས་སུ་མེད་པས་ཟབ། །
en: You are profound because saṃsāra and nirvāṇa are not two.

source: སེམས་ཅན་སངས་རྒྱས་གཉིས་སུ་མེད་པས་འཕགས། །
en: “You are exalted because ordinary beings and buddhas are not two.

source: ལས་དང་རྣམ་སྨིན་གཉིས་སུ་མེད་པས་བསྟོད། །
en: I praise you because action and result are not two.

source: རྒྱུ་དང་འབྲས་བུ་གཉིས་སུ་མེད་པས་སྨིན། །
en: You are the result because cause and effect are not two.

source: ཡུལ་དང་ཡུལ་ཅན་གཉིས་མེད་གཅིག་གི་དང་། །སྤྲོས་དང་སྤྲོས་མེད་དོན་དམ་དབྱིངས་ཀྱིས་བསྡུས། །
en: “You are the single state, the nonduality of subject and object, The ultimate space that subsumes conceptuality and its absence.

source: བསོད་ནམས་ཡེ་ཤེས་གཉིས་མེད་ཚོགས་ཆེན་ཏེ། །
en: You are the great accumulation of nondual merit and wisdom.

source: མཐོང་དང་དམ་པ་གཉིས་མེད་དག་པས་བསྟོད། །
en: I praise you as the pure nonduality of the perceptible and the ultimate.

source: བདག་དང་གཞན་གྱི་ཆོས་ནི་ངང་ཚུལ་གཅིག །གཟུང་དང་འཛིན་པ་གཉིས་མེད་ཟབ་མོའི་མཐུ། །མཐོ་རིས་ངན་སོང་གཉིས་བྲལ་དག་པའི་ཞིང་། །
en: “You are the single expression of the phenomena of self and other, The profound power of the nonduality of apprehended and apprehender, And the purified field, free from both higher and lower rebirth.

source: བཟང་ངན་གཉིས་མེད་རང་བཞིན་གཅིག་གིས་བསྟོད། །
en: I praise you as the single nondual nature of good and bad.

source: བསྐྱེད་མེད་རྫོགས་པ་གཉིས་མེད་ལྷུན་གྲུབ་མཆོག །སེམས་དང་ཕུང་པོ་གཉིས་མེད་སེམས་ཉིད་དེ། །སྒྲུབ་དང་བསྒྲུབ་བྱ་གཉིས་མེད་གྲུབ་པའི་ངང་། །
en: “You are supreme as unproduced, complete, spontaneously present nonduality, The mind itself in which mind and the aggregates are not separate, The state in which one attains the nonduality of practice and its goal.

source: བདག་གཞན་གཉིས་མེད་ཚུལ་མཆོག་གཅིག་གིས་བསྐྱོད། །
en: I praise you as the supreme expression of the nonduality of self and other.

source: ཡབ་དང་ཡུམ་མཁའ་གཉིས་མེད་བྱང་ཆུབ་སེམས། །ཐབས་དང་ཤེས་རབ་གཉིས་སུ་མེད་པའི་དོན། །སྟོང་དང་མི་སྟོང་གཉིས་མེད་ཞི་བའི་ངང་། །
en: “You are bodhicitta, the nondual space of male and female, The nondual object of method and wisdom, And the peaceful state in which empty and not empty are inseparable.

source: གྱུར་དང་འགྱུར་མེད་རྩོལ་བྲལ་ཕྱག་འཚལ་བསྟོད། །
en: Homage and praise to you, effortlessly changeable and unchanging.

source: སྒྲ་ཚིག་གཉིས་མེད་བརྗོད་པ་མེད་པའི་ངང་། །ལུས་ངག་གཉིས་མེད་སེམས་ཉིད་གཅིག་གི་ཚུལ། །
en: “You are the ineffable state, the nonduality of word and sound, The singular mode of the mind itself, inseparable from body and mind.

source: རྩོལ་བྱེད་རྩོལ་བྱ་གཉིས་མེད་དོན་གཅིག་པས། །རྣམ་པར་སྤྲོས་མེད་དོན་དམ་དབྱིངས་ཀྱིས་བསྟོད། །
en: Because you are the single object, the nonduality of effort and its goal, I praise you as the ultimate realm devoid of conceptuality.

source: མུ་སྟེགས་སངས་རྒྱས་གཉིས་མེད་ཚུལ་གཅིག་པས། །དབྱིངས་དང་ཡེ་ཤེས་གཉིས་མེད་དོན་རྟོགས་ཏེ། །
en: “Since there is one system in which Buddhists and non-Buddhists are not two, You have realized that the phenomenal world and wisdom are nondual.

source: སྲིད་དང་རྣམ་གྲོལ་ཡང་དག་དོན་གཅིག་པས། །ཐམས་ཅད་གཉིས་མེད་སྐུ་ལ་ཕྱག་འཚལ་བསྟོད། །
en: Since existence and liberation are one true reality, I praise and honor you as the nondual body of everything.

source: ཕྱི་དང་ནང་མེད་གཉིས་མེད་གཅིག་གི་ངང་། །སེམས་ལྡན་སེམས་མེད་རྣམ་དག་ཞི་བའི་ཚུལ། །སྣང་དང་མི་སྣང་གཉིས་མེད་གཅིག་གིས་མཐོང་། །
en: “You are the single state of nonduality in which internal and external do not exist, The pure peaceful mode of sentience and insentience, And are seen as singular, the nonduality of the apparent and unapparent.

source: གཉིས་མེད་དོན་མཆོག་ཁྱོད་ལ་ཕྱག་འཚལ་བསྟོད། །
en: Homage and praise to you, the supreme nondual referent.

source: འདི་དག་རྣམས་ནི་དོན་དམ་ཟབ་མོའི་ཚུལ། །སྤྲོས་པ་མེད་པའི་དོན་དང་འབྲེལ་པ་སྟེ། །
en: “All of this is the profound expression of the ultimate And is concerned with a referent free of conceptuality.

source: འདི་རྣམས་ལྷ་མོ་ཁྱོད་ཀྱི་ཐུགས་ལ་གསལ། །འདི་ལྟར་བསྟོད་པས་བདག་ཀྱང་ཁྱོད་ལྟར་ཤོག །
en: All of this illuminates your mind, Goddess— Through this praise, may I also become like you.”

source: དེའི་ཚེ་དེའི་དུས་ན་དྲི་ཟའི་རྒྱལ་པོ་ཟུར་ཕུད་ལྔ་པས་དཔལ་ལྷ་མོ་ལ་ཕྲིན་ལས་ཀྱི་སྒོ་ནས་བསྟོད་པ། སེམས་ཉིད་ཕྲིན་ལས་རྣམ་བཞིའི་ཁྱད་པར་ནི། །
en: At that point, the gandharva king Pañcaśikha praised Śrīdevī in terms of her ritual activity: “The mind itself is distinguished as the four ritual activities.

source: སེམས་ཉིད་གུད་ན་མེད་ཅིང་སེམས་ཀྱང་མེད། །
en: They are nothing other than mind itself but are devoid of mind.

source: དོན་དམ་སྤྲོས་བྲལ་ཁ་དོག་གཟུགས་ཀྱང་མེད། །
en: Ultimately, the mind itself is free of conceptuality and lacks color and form.

source: ཀུན་རྫོབ་སྒྱུ་མ་ཙམ་དུ་རང་གི་སེམས། །
en: Conventionally, it is one’s own mind as mere illusion.

source: མཐུན་པར་བསྟན་པའི་ཞི་བའི་དཔལ་ལྷ་མོ། །ཞི་མཛད་ཞི་འགྱུར་ཞི་བའི་ངང་ཚུལ་ཅན། །
en: “Glorious pacifying goddess who is widely extolled, You pacify, are pacifying, and have a pacifying nature.

source: ཞི་བའི་འཁོར་གྱིས་བསྐོར་བའི་གཙོ་མོ་ནི། །རྟགས་ཀྱི་སྐུ་མདོག་དཀར་མོ་ཤིན་ཏུ་དངས། །
en: You are a queen surrounded by a peaceful retinue And have white physical marks that shine brightly.

source: ཀུན་དུ་ཞི་མཛད་ཁྱོད་ལ་ཕྱག་འཚལ་བསྟོད། །
en: “Homage and praise to you, all-pacifying goddess.

source: བདག་གི་དགྲ་དང་ནད་རྣམས་ཞི་བར་མཛོད། །
en: Please pacify my enemies and illnesses.

source: མཐུན་པར་བསྟན་པའི་རྒྱས་པའི་དཔལ་ལྷ་མོ། །རྒྱས་མཛད་རྒྱས་འགྱུར་རྒྱས་པའི་ངང་ཚུལ་ཅན། །
en: “Glorious enriching goddess who is widely extolled, You enrich, are enriching, and have an enriching nature.

source: རྒྱས་པའི་འཁོར་གྱིས་བསྐོར་བའི་གཙོ་མོ་ནི། །རྟགས་ཀྱི་སྐུ་མདོག་སེར་མོ་ཤིན་ཏུ་བརྗིད། །
en: You are a queen surrounded by an enriching retinue And have golden physical marks that are intensely majestic.

source: ཀུན་དུ་རྒྱས་མཛད་མ་ལ་ཕྱག་འཚལ་བསྟོད། །
en: “Homage and praise to you, all-enriching goddess.

source: བདག་གི་བསོད་ནམས་ཡེ་ཤེས་རྒྱས་པར་མཛོད། །
en: Please increase my merit and wisdom.

source: མཐུན་པར་བསྟན་པའི་དབང་མོ་དཔལ་ལྷ་མོ། །དབང་མཛད་དབང་བསྒྱུར་དབང་གི་ངང་ཚུལ་ཅན། །
en: “Glorious enthralling goddess who is widely extolled, You enthrall, are enthralling, and have an enthralling nature.

source: དབང་གི་འཁོར་གྱིས་བསྐོར་བའི་གཙོ་མོ་ནི། །རྟགས་ཀྱི་སྐུ་མདོག་དམར་མོ་ཤིན་ཏུ་བརྗིད། །
en: You are a queen surrounded by an enthralling retinue And have red physical marks that are intensely majestic.

source: ཀུན་དུ་དབང་མཛད་ཁྱོད་ལ་ཕྱག་འཚལ་བསྟོད། །
en: “Homage and praise to you, all-enthralling goddess.

source: བདག་གི་ནད་དང་དགྲ་རྣམས་དབང་དུ་མཛོད། །མཐུན་པར་བསྟན་པའི་དྲག་མོ་དཔལ་ལྷ་མོ། །
en: Please bring my illnesses and enemies under your control.

source: དྲག་མཛད་དྲག་འགྱུར་དྲག་མོའི་ངང་ཚུལ་ཅན། །
en: “Glorious wrathful goddess who is widely extolled, You bring wrath, are wrathful, and have a wrathful nature.

source: དྲག་མོའི་འཁོར་གྱིས་བསྐོར་བའི་གཙོ་མོ་ནི། །རྟགས་ཀྱི་སྐུ་མདོག་ནག་མོ་ཤིན་ཏུ་བརྗིད། །
en: You are a queen surrounded by a wrathful retinue And have dark physical marks that are intensely majestic.

source: ཀུན་དུ་དྲག་མཛད་ཁྱོད་ལ་ཕྱག་འཚལ་བསྟོད། །
en: “Homage and praise to you, all-wrathful goddess.

source: བདག་གི་ནད་དང་དགྲ་རྣམས་དྲག་མོས་སོད། །
en: Please kill my illnesses and enemies with your wrath.

source: ཁྱོད་ཀྱི་རང་བཞིན་ཅིར་ཡང་མ་གྲུབ་ལ། །འདི་ལྟར་འཛིན་ཉིད་ཅིར་ཡང་སྣང་བ་ནི། །
en: “Your true nature is not established in any way, But you can appear with any of these characteristics.

source: ཕྲིན་ལས་རྣམ་བཞིས་འགྲོ་དོན་མཛད་པ་ལགས། །
en: This is what allows the four ritual activities to benefit beings.

source: བདག་ཀྱང་ལས་བཞི་རང་བཞིན་ལྷུན་གྲུབ་ནས། །ཁྱོད་ལྟར་གཞན་གྱི་དོན་ལ་བརྩོན་པར་ཤོག །
en: May I spontaneously accomplish the nature of the four ritual activities And strive to benefit others just as you do.”

source: དེ་ནས་དཔལ་ལྷ་མོ་ནག་མོ་ལ་ཀླུའི་རྒྱལ་པོ་དགའ་བོས་སྐུའི་ཡོན་ཏན་གྱི་སྒོ་ནས་བསྟོད་པ། གསང་སྔགས་རྣལ་འབྱོར་གྲུབ་པའི་བདག་ཉིད་མ། །
en: Next, the nāga king Nanda praised Śrīdevī Kālī in terms of her physical features: “You are identical with the accomplishment of mantra-yoga.

source: ཡོན་ཏན་རྣམས་ཀྱི་སྐུ་མདོག་ཕྱག་མཚན་ནི། །དོན་དུ་སྣང་བ་མེད་ཀྱང་གདུལ་བྱའི་ཕྱིར། །རྟགས་ཀྱི་ཕྱག་རྒྱ་འདི་ལྟར་བསྟན་པའོ། །ཁམས་གསུམ་གདུལ་ཕྱིར་གདན་དུ་བོང་བུ་ཞོན། །མྱ་ངན་མི་འདའི་རྟགས་སུ་ལྕགས་སྒྲོག་མངའ། །
en: The colors and forms of your physical attributes Are insubstantial but, in order to tame beings, Are taught using these symbolic features: “You ride a donkey because you tame the three realms And wear shackles to symbolize that you will not pass into nirvāṇa.

source: བདག་དོན་ལྷུན་གྲུབ་གླང་ཆེན་ཀོ་བས་བརྒྱན། །གཞན་དོན་ཕུན་སུམ་ཚོགས་ཕྱིར་རེ་ལྡེས་དཀྲིས། །
en: You are draped with an elephant hide to show you spontaneously accomplish your own benefit And are wrapped with a pelt to show that you fulfill the benefit of others.

source: བྱང་ཆུབ་སེམས་ལྡན་སྤྱི་གཙུག་ཟླ་རྒྱས་གསལ། །
en: “A full moon illuminates your crown because you possess bodhicitta.

source: ཤེས་རབ་རྟོགས་ཕྱིར་ལྟེ་བ་ཉི་མས་བརྒྱན། །
en: A sun adorns your stomach because you have realized insight.

source: དུག་གསུམ་སྡོང་པོ་གཅོད་པའི་རལ་གྲི་དང་། །བསོད་ནམས་གཏེར་གྱི་ཕྱག་མཚན་ནེའུ་ལེ་བསྣམས། །
en: You hold a sword that cuts the stalk of the three poisons And a mongoose symbolizes your treasure of merit.

source: དབང་དྲག་རྫོགས་ཕྱིར་རལ་པ་ཁམ་ནག་སྤྲུག །
en: “Your disheveled, deep yellow locks indicate your perfection of enthralling and wrathful rites.

source: ཉོན་མོངས་འདྲེན་ཕྱིར་རྣོ་དཔལ་མཆེ་བ་གཙིགས། །
en: You bare your sharp fangs, symbolizing the removal of afflictions.

source: འཁོར་བ་ལྗགས་ལ་གཏར་ཕྱིར་རྐན་སྒྲ་བརྡེབ། །གདུག་པ་ཞེ་ལ་གནོད་ཕྱིར་སྡང་མིག་བགྲད། །
en: You click your palate because the blood of saṃsāra is on your tongue And you have a wide, angry glare because you harm hateful, wicked beings.

source: ཐམས་ཅད་དབང་དུ་སྡུད་ཕྱིར་སྤྱན་རྩ་དམར། །
en: “Your eyes are bloodshot because you enthrall everything.

source: སྙོམས་པའི་ཚོགས་མཆོག་མི་འགྱུར་སྐུ་མདོག་གནག །
en: You have a dark complexion to show your supreme, unwavering store of equanimity.

source: མ་མོ་འདུལ་ཕྱིར་དུར་ཁྲོད་རྒྱན་གྱིས་བརྒྱན། །སྐུ་གསུང་ཐུགས་རྟགས་ཕྱག་རྒྱ་ཁ་ཊྭཱྃ་གསོར། །
en: You wear charnel ground ornaments because you tame the mātṛkās And you brandish a khaṭvāṅga, symbolizing body, speech, and mind.

source: སྐུ་གསུམ་རྫོགས་བྱེད་ཐོད་པའི་ཕྲེང་བས་བརྒྱན། །
en: “You wear a garland of skulls because you have perfected the three bodies.

source: དྲག་པོ་མྱུར་མགྱོགས་བསྟན་ཕྱིར་ཚུབ་མས་བརྒྱན། །
en: You are adorned with a whirlwind to indicate your swift wrath.

source: ཉོན་མོངས་སྲེག་ཕྱིར་མེ་དཔུང་ནང་ན་བཞུགས། །འདོད་ཁམས་སྐྱོང་ཕྱིར་ཡོངས་འདུའི་ཤིང་ལ་བརྟེན། །
en: You stand within a blazing fire because you have burned up the afflictions And you lean against the pāriyātraka tree because you protect the desire realm.

source: ལྷ་མིན་འདུལ་ཕྱིར་རྫོང་གི་དཀའ་ཟློག་མ། །
en: “You are the impenetrable goddess of the fortress because you tamed the asuras.

source: དཔའ་བརྟན་བསྟན་ཕྱིར་སྟག་གི་ཤམ་ཐབས་བསྣམས། །བསྟན་པ་བསྲུང་ཕྱིར་དྲག་མོའི་ཆ་ལུགས་རྫོགས། །
en: You wear a tiger skin skirt to show your steadfast courage And the complete set of wrathful attire because you protect the teachings.

source: ང་རྒྱལ་དབང་བསྡུད་བདག་མེད་སྒྲ་སྒྲོགས་ཕྱིར། །ཐབས་ཀྱི་སྙན་ཆ་གཡས་པ་སེང་གེས་བརྒྱན། །
en: “Since the roar of no-self shows a mastery of pride, A lion adorns your right earring, symbolizing method.

source: ཞེ་སྡང་དབང་འདུལ་དུག་ཆེན་འདུལ་བའི་ཕྱིར། །ཤེས་རབ་སྙན་ཆ་གཡོན་པ་སྦྲུལ་གྱིས་བརྒྱན། །
en: Since you have tempered the power of anger and tamed the great poison, A snake adorns your left earring, symbolizing insight.

source: འདུ་བྱེད་མི་རྟག་རྟགས་སུ་དྲིལ་བུ་སྒྲོགས། །
en: “You ring a bell, symbolizing the impermanence of compounded phenomena.

source: ཆགས་ཕྱིར་རྔམ་མཛད་རཀྟའི་རྦ་ཀློང་འཐུང་། །
en: Because you stoke rage toward attachment, you drink waves of blood.

source: དམ་ཚིག་བསྲུང་ཕྱིར་ཞིང་ལྤགས་རྒྱན་དུ་མཛད། །ཐ་དད་ལས་རྣམས་འདུལ་ཕྱིར་རྨ་བྱའི་འཕྲུ། །
en: You wear tree bark as adornment because you guard your samaya And a peacock crown ornament since you govern the different ritual actions.

source: ཉོན་མོངས་སྒྲིབ་པའི་ཚོགས་རྣམས་རབ་སྦྱངས་ནས། །ཡེ་ཤེས་རིག་པའི་ཚོགས་རྣམས་ཤར་བའི་ཕྱིར། །རང་བཞིན་གནས་མཆོག་བྱང་ཤར་མཚམས་ན་བརྟེན། །
en: “Because you purified the collection of afflictive obscurations And your wisdom manifests as the body of vidyās, You stand firm in the northeast, the supreme natural abode.

source: དབུ་མའི་ས་ལ་གནས་ཕྱིར་དྲེའུ་ལ་ཞོན། །ཉོན་མོངས་གདུག་པ་འདུལ་ཕྱིར་མ་ཡི་ཚུལ། །
en: You ride a donkey because you abide in the middle way And you take the guise of a mother because you tame the wicked afflictions.

source: མཁའ་འགྲོ་མ་མོ་ཁྱོད་ལ་ཕྱག་འཚལ་བསྟོད། །
en: Homage and praise to you, mother of ḍākinīs!”

source: དེ་ནས་གྲུལ་བུམ་གྱི་རྒྱལ་པོ་སྦྲུལ་མགོ་དགུ་པས་དཔལ་ལྷ་མོ་ནག་མོ་ལ་སྐུ་གསུང་ཐུགས་ཀྱི་སྒོ་ནས་བསྟོད་པ། དོན་དམ་གཉིས་མེད་བྱང་ཆུབ་སེམས་ཡིན་ཡང་། །སྲིད་གསུམ་གདུལ་ཕྱིར་རྟགས་ཀྱི་ཕྱག་རྒྱ་ནི། །
en: Next, the kumbhāṇḍa king Nine-Headed Snake praised Śrīdevī in terms of body, speech, and mind: “Though bodhicitta is ultimately nondual, Her symbolic attributes are the three existences.

source: རང་སེམས་རྣམ་དག་དྲག་པོའི་གཞལ་ཡས་ཁང་། །རཀྟ་ཁྲག་གི་རྒྱ་མཚོ་འཁྱིལ་པ་ལས། །ཀེང་རུས་ཐོད་ཕྲེང་ཞིང་གི་པགས་པས་བརྒྱན། །
en: Her pure mind is the wrathful palace, Which emerges from the ocean of blood that surrounds it And is adorned with skeletons, skull garlands, and flayed skin.

source: སྐུ་མདོག་གནག་ལ་རབ་འཇིགས་ཁྲོ་མོ་རྒྱལ། །སྔོན་མོ་རལ་པ་འཛིངས་མའི་སྤྲུལ་པ་འགྱེད། །
en: “The wrathful queen is utterly terrifying in her dark body, Sending forth emanations of female beings with shaggy blue locks.

source: སྐུ་ཡི་སྤྲུལ་པ་དཔལ་ལྡན་རེ་མ་ཛུ། །
en: “Glorious Remaju is her body emanation.
